tap "57uff3r/mac-apps"
tap "homebrew/bundle"
tap "sijanc147/formulas"
# Securely send things from one computer to another
brew "croc"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Platform built on V8 to build network applications
brew "node"
# General-purpose scripting language
brew "php"
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Internet file retriever
brew "wget"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "57uff3r/mac-apps/ibooks_notes_exporter"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Menu bar icon organizer
cask "bartender"
# Client for the Dropbox cloud storage service
cask "dropbox"
# European dictionary
cask "eudic"
# Calendar software
cask "fantastical"
# Project management software
cask "feishu"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Web browser
cask "google-chrome"
# Tool for multi-language users
cask "input-source-pro"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Word processor
cask "microsoft-word"
# Open-source download manager
cask "motrix"
# Media player
cask "movist-pro"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# PDF reader, editor and annotator
cask "pdf-expert"
# Used to access context-specific actions when text is selected
cask "popclip"
# Control your tools with a few keystrokes
cask "raycast"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Free messaging and calling application
cask "wechat"
# Native desktop client for WhatsApp
cask "whatsapp"
# Lossless audio decoder
cask "xld"
# YouTube Music Desktop App
cask "youtube-music"
mas "APTV", id: 1630403500
mas "Byword", id: 420212497
mas "Drafts", id: 1435957248
mas "Exporter", id: 1099120373
mas "Invoice", id: 1670679663
mas "Keynote", id: 409183694
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "Numbers", id: 409203825
mas "Rosetta Stone", id: 1476088902
mas "Tampermonkey", id: 1482490089
mas "Things", id: 904280696
mas "VidHub", id: 1659622164
mas "Xcode", id: 497799835
