tap "57uff3r/mac-apps"
tap "homebrew-ffmpeg/ffmpeg"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lencx/chatgpt", "https://github.com/lencx/ChatGPT.git"
tap "pot-app/tap"
tap "sandreas/tap"
tap "sijanc147/formulas"
tap "zackelia/formulae"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# General-purpose scripting language
brew "php", restart_service: true
# Dependency Manager for PHP
brew "composer"
# Securely send things from one computer to another
brew "croc"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Work with ID3 metadata in .mp3 files
brew "eye-d3"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Keep your Mac's application settings in sync
brew "mackup"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql", restart_service: true
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx", restart_service: true
# Platform built on V8 to build network applications
brew "node"
# Web interface for MySQL and MariaDB
brew "phpmyadmin"
# Theme for zsh
brew "powerlevel10k"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Tool to create Python bindings for C and C++ libraries
brew "sip"
# Official tldr client written in Rust
brew "tlrc"
# Internet file retriever
brew "wget"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
brew "57uff3r/mac-apps/ibooks_notes_exporter"
# Play, record, convert, and stream audio and video
brew "homebrew-ffmpeg/ffmpeg/ffmpeg", args: ["with-fdk-aac"]
# Read, create, and modify MP4 files
brew "sandreas/tap/mp4v2"
# macOS command-line utility to limit max battery charge
brew "zackelia/formulae/bclm"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Cloud storage service
cask "baidunetdisk"
# Menu bar icon organiser
cask "bartender"
# Collect, organise, edit and annotate documents
cask "devonthink"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Dictionary and translator app
cask "easydict"
# European dictionary
cask "eudic"
# Project management software
cask "feishu"
# Utility to provide quick look previews for files that aren't natively supported
cask "glance-chamburr"
# Web browser
cask "google-chrome"
# Tool for multi-language users
cask "input-source-pro"
# Menu bar calendar
cask "itsycal"
# File archiver
cask "keka"
# Helper application for the Keka file archiver
cask "kekaexternalhelper"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Word processor
cask "microsoft-word"
# Open-source download manager
cask "motrix"
# Media player
cask "movist-pro"
# Free and open-source RSS reader
cask "netnewswire"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Get up and running with large language models locally
cask "ollama"
# Interact with Ollama models
cask "ollamac"
# PDF reader, editor and annotator
cask "pdf-expert"
# Used to access context-specific actions when text is selected
cask "popclip"
# File sync and share software
cask "resilio-sync"
# Video game digital distribution service
cask "steam"
# Text editor for code, markup and prose
cask "sublime-text"
# Messaging app with a focus on speed and security
cask "telegram"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Open-source code editor
cask "visual-studio-code"
# Video conferencing software
cask "voov-meeting"
# Rust-based terminal
cask "warp"
# Free messaging and calling application
cask "wechat"
# Native desktop client for WhatsApp
cask "whatsapp"
# Lossless audio decoder
cask "xld"
mas "Adblock Plus", id: 1432731683
mas "AdGuard for Safari", id: 1440147259
mas "APTV", id: 1630403500
mas "AudioBookBinder", id: 413969927
mas "Bear", id: 1091189122
mas "Byword", id: 420212497
mas "Drafts", id: 1435957248
mas "Exporter", id: 1099120373
mas "Infuse", id: 1136220934
mas "Invoice", id: 1670679663
mas "Keynote", id: 409183694
mas "MarkDownload - Markdown Web Clipper", id: 1554029832
mas "Microsoft Remote Desktop", id: 1295203466
mas "MWeb", id: 1183407767
mas "Numbers", id: 409203825
mas "obsidian-highlighter", id: 1613923144
mas "PopClip", id: 445189367
mas "Rosetta Stone", id: 1476088902
mas "RSSHub Radar", id: 1610744717
mas "Server Box", id: 1586449703
mas "Tampermonkey", id: 1482490089
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "uBlacklist for Safari", id: 1547912640
mas "VidHub", id: 1659622164
mas "Xcode", id: 497799835
vscode "codeium.codeium"
vscode "esbenp.prettier-vscode"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
